import sqlite3


def create_database():
    conn = sqlite3.connect('school.db')
    cursor = conn.cursor()
    cursor.execute('''
        CREATE TABLE IF NOT EXISTS students (
            id INTEGER PRIMARY KEY AUTOINCREMENT,
            full_name TEXT NOT NULL,
            class TEXT NOT NULL,
            plus_count INTEGER DEFAULT 0,
            minus_count INTEGER DEFAULT 0
        )
    ''')

    conn.commit()
    conn.close()


def add_test_data():
    conn = sqlite3.connect('school.db')
    cursor = conn.cursor()
    students = [
        ('Аверин Дмитрий', "11И", 0, 0),
        ('Алтушкин Егор', "11И", 0, 0),
        ('Алыхов Никита', "11И", 0, 0),
        ('Буякова Татьяна', "11И", 0, 0),
        ('Волковицкая Евгения', "11И", 0, 0),
        ('Гончаров Роман', "11И", 0, 0),
        ('Давыдов Александр', "11И", 0, 0),
        ('Киселёва Анна', "11И", 0, 0),
        ('Козлов Роман', "11И", 0, 0),
        ('Копцева Дарья', "11И", 0, 0),
        ('Королев Степан', "11И", 0, 0),
        ('Кузьмин Геннадий', "11И", 0, 0),
        ('Курков Михаил', "11И", 0, 0),
        ('Кусаев Марк', "11И", 0, 0),
        ('Лошкарев Иван', "11И", 0, 0),
        ('Метревели Даниил', "11И", 0, 0),
        ('Можаев Илья', "11И", 0, 0),
        ('Потемкин Егор', "11И", 0, 0),
        ('Рогачев Данила', "11И", 0, 0),
        ('Слизкий Вячеслав', "11И", 0, 0),
        ('Смирнов Владислав', "11И", 0, 0),
        ('Сучкова Юлия', "11И", 0, 0),
        ('Тарасов Егор', "11И", 0, 0),
        ('Торохтунов Алексей', "11И", 0, 0),
        ('Точилкин Сергей', "11И", 0, 0),
        ('Ушкарова Мария', "11И", 0, 0),
        ('Феденко Анастасия', "11И", 0, 0),
        ('Шахов Георгий', "11И", 0, 0),
        ('Бутакова Мария', "10Г", 0, 0),
        ('Вахрушина Лада', "10Г", 0, 0),
        ('Волкова Мария', "10Г", 0, 0),
        ('Гопко Тимофей', "10Г", 0, 0),
        ('Гук Лев', "10Г", 0, 0),
        ('Гусенкова Александра', "10Г", 0, 0),
        ('Дёмочкина Мирослава', "10Г", 0, 0),
        ('Епихова Ева', "10Г", 0, 0),
        ('Карпович Максим', "10Г", 0, 0),
        ('Клименко Денис', "10Г", 0, 0),
        ('Клишина Анна', "10Г", 0, 0),
        ('Конышева Арина', "10Г", 0, 0),
        ('Кузнецов Артём', "10Г", 0, 0),
        ('Лазарева Вероника', "10Г", 0, 0),
        ('Лихачева Ксения', "10Г", 0, 0),
        ('Маклецова Мария', "10Г", 0, 0),
        ('Меркулова Вероника', "10Г", 0, 0),
        ('Меркушова Вера', "10Г", 0, 0),
        ('Моисеев Илья', "10Г", 0, 0),
        ('Музыкова Софья', "10Г", 0, 0),
        ('Налбандян Артём', "10Г", 0, 0),
        ('Петренко Илья', "10Г", 0, 0),
        ('Подгорная Софья', "10Г", 0, 0),
        ('Прусов Егор', "10Г", 0, 0),
        ('Путенкова София', "10Г", 0, 0),
        ('Рябова Екатерина', "10Г", 0, 0),
        ('Степанянц Степан', "10Г", 0, 0),
        ('Сушкова Ирина', "10Г", 0, 0),
        ('Телегин Дмитрий', "10Г", 0, 0),
        ('Трегубова Мария', "10Г", 0, 0),
        ('Федулов Андрей', "10Г", 0, 0),
        ('Фроленкова Василиса', "10Г", 0, 0),
        ('Щербакова Екатерина', "10Г", 0, 0)
    ]

    cursor.executemany('''
        INSERT INTO students (full_name, class, plus_count, minus_count) 
        VALUES (?, ?, ?, ?)
    ''', students)

    conn.commit()
    conn.close()


if __name__ == '__main__':
    create_database()
    add_test_data()
